**Week5**
#Introduction to SQL
#Introduction to SQL ++
**DDL**

**DML**

**WHERE Statements**

**Different Types of Joins**

**SubQueries**

**Union**

**Intersect**

**Triggers**

**Stored Procedures**

**Wildcards**

**CTEs**

In [ ]:
import sqlite3

# DDL
DDL stands for "Data Definition Language" in SQL. It is a subset of SQL statements used to define and manage the structure of a database, including creating, altering, and deleting database objects like tables, indexes, and views. DDL statements are not used to manipulate or retrieve data; instead, they are used to specify how data should be stored and organized within a database.

SQL stands for Structure Query Language

**Create**

This statement is used to create new database objects such as tables, indexes, views, and schemas.

In [ ]:
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Email VARCHAR(100)
);

**Alter**

The ALTER statement is used to modify the structure of existing database objects. You can use it to add, modify, or delete columns, constraints, or other properties of a table.

In [ ]:
ALTER TABLE Customers
ADD PhoneNumber VARCHAR(20);

**DROP**

The DROP statement is used to delete existing database objects like tables, indexes, or views.

In [ ]:
DROP TABLE Customers;

**Truncate**

This statement is used to quickly remove all rows from a table, effectively resetting it without deleting the table structure itself.

In [ ]:
TRUNCATE TABLE Customers;

**Rename**
some database management systems support the RENAME statement to change the name of a database object.

In [ ]:
RENAME TABLE Customers TO Clients;

#DML
DML stands for "Data Manipulation Language" in SQL. Unlike DDL (Data Definition Language), which is used to define and manage the structure of a database, DML is used to interact with and manipulate the data stored within a database. DML consists of SQL statements that allow you to perform operations such as querying, inserting, updating, and deleting data in a database. Some common DML statements include:

**SELECT**: The SELECT statement is used to retrieve data from one or more tables. It allows you to specify the columns you want to retrieve and apply various filtering and sorting criteria.

In [ ]:
SELECT column1, column2
FROM table_name
WHERE condition;

**INSERT:** The INSERT statement is used to add new rows of data into a table.

In [ ]:
INSERT INTO table_name (column1, column2)
VALUES (value1, value2);

**UPDATE:** The UPDATE statement is used to modify existing data in a table based on a specified condition.

In [ ]:
UPDATE table_name
SET column1 = new_value1
WHERE condition;

**DELETE:** The DELETE statement is used to remove rows from a table based on a specified condition.

In [ ]:
DELETE FROM table_name
WHERE condition;

to select all the fields from one table we use *
to save reult we use as creat veiw

**Wildcard**

to use this wild card we will be using * character it selects all the

In [ ]:
# Find all customers whose names start with 'J'
SELECT * FROM customers WHERE customer_name LIKE 'J%';

# Find all products containing 'widget' in their name
SELECT * FROM products WHERE product_name LIKE '%widget%';

#Find all email addresses ending in '.com'
SELECT * FROM email_addresses WHERE email LIKE '%.com';

# Find all words that start with 'c' and have three characters
SELECT * FROM words WHERE word LIKE 'c__';

**Percent Sign (%) Wildcard**: The percent sign (%) is used to match any sequence of characters (including zero characters) within a string. It can be used to represent any number of characters at a particular position in a string.

LIKE 'a%' matches any string that starts with the letter 'a'.
LIKE '%ing' matches any string that ends with 'ing'.
LIKE '%book%' matches any string containing the substring 'book' anywhere within it.

**Underscore (_) Wildcard**:

 The underscore (_) is used to match any single character within a string. It represents a single character placeholder.

LIKE '_pple' matches 'apple', 'apply', but not 'apples'.
LIKE 'T_m' matches 'Tom', 'Tim', but not 'Tome' or 'Tomm'.

#Where Statement
In order to filter rows from a table according to a certain criterion or group of conditions, use the WHERE clause. Instead of retrieving all rows from a table, it enables you to simply retrieve the rows that satisfy particular requirements. The SELECT, UPDATE, DELETE, and INSERT INTO statements are just a few examples of how the WHERE clause is utilized in SQL queries.

In [ ]:
SELECT column1, column2, ...
FROM table_name
WHERE condition;

example

In [ ]:
SELECT * FROM customers WHERE last_name = 'Smith';

In [ ]:
SELECT * FROM products WHERE price < 50;

In [ ]:
SELECT * FROM employees WHERE hire_date > '2022-01-01';

In [ ]:
SELECT * FROM orders WHERE customer_id = 123;

#DIFFERENT TYPE OF JOINS
INNER JOIN (or EQUIJOIN)

LEFT JOIN (or LEFT OUTER JOIN)

RIGHT JOIN (or RIGHT OUTER JOIN):

FULL JOIN (or FULL OUTER JOIN)

CROSS JOIN (or CARTESIAN JOIN):

SELF JOIN



*   **INNER JOIN** An inner join returns only the rows that have matching values in both tables being joined. It filters out rows that do not have corresponding matches in the other table.

In [ ]:
SELECT employees.name, departments.department_name
FROM employees
INNER JOIN departments ON employees.department_id = departments.department_id;

* **LEFT JOIN**
A left join returns all rows from the left table and the matching rows from the right table. If there is no match in the right table, NULL values are returned for columns from the right table.

In [ ]:
SELECT customers.customer_name, orders.order_date
FROM customers
LEFT JOIN orders ON customers.customer_id = orders.customer_id;

* **RIGHT JOIN**
 A right join is the reverse of a left join. It returns all rows from the right table and the matching rows from the left table. If there is no match in the left table, NULL values are returned for columns from the left table.

In [ ]:
SELECT orders.order_date, order_items.product_name
FROM orders
RIGHT JOIN order_items ON orders.order_id = order_items.order_id;


*   **FULL JOIN (or FULL OUTER JOIN):**
A full join returns all rows from both the left and right tables. If there is no match in either table, NULL values are returned for columns from the table without a match.

In [ ]:
SELECT customers.customer_name, orders.order_date
FROM customers
FULL JOIN orders ON customers.customer_id = orders.customer_id;

*  **CROSS JOIN (or CARTESIAN JOIN):**
 A cross join returns the Cartesian product of two tables, which means it combines each row from the first table with every row from the second table. It results in a large number of rows, and it's typically used for specific purposes, such as generating combinations.

In [ ]:
SELECT products.product_name, suppliers.supplier_name
FROM products
CROSS JOIN suppliers;

*   **SELF JOIN:**
A self join is when a table is joined with itself. It's useful when you have a hierarchical or recursive relationship within a single table.

In [ ]:
SELECT e1.employee_name, e2.manager_name
FROM employees e1
INNER JOIN employees e2 ON e1.manager_id = e2.employee_id;

#UNION

UNION operator is used to combine the result sets of two or more SELECT queries into a single result set. It is often used when you want to retrieve data from multiple tables or queries and present the results as a unified set of rows. The UNION operator removes duplicate rows by default, but you can use UNION ALL to include duplicate rows as well.

In [ ]:
#Combine results of two queries to retrieve a list of all employees and customers.
SELECT employee_id AS id, employee_name AS name, 'Employee' AS type
FROM employees
UNION
SELECT customer_id AS id, customer_name AS name, 'Customer' AS type
FROM customers;

#INTERSECT

The INTERSECT operator compares the result sets produced by the specified SELECT queries and returns only the rows that exist in all of them.

In [ ]:
SELECT column1, column2, ...
FROM table1
INTERSECT
SELECT column1, column2, ...
FROM table2;

#Stored Procedure

**Modularity:** Stored procedures promote modularity and code reusability

**Security:** Stored procedures can be used to control access to data and database operations.

**Performance:** Stored procedures are precompiled and optimized by the DBMS, which can lead to improved performance compared to executing ad-hoc SQL statements.

**Data Integrity:**They help enforce data integrity rules and business logic within the database.

**Transaction Control:**Stored procedures can be used to group multiple SQL statements into a single transaction, allowing you to ensure data consistency and integrity even in complex operations.

**Reduced Network Traffic:**Since stored procedures are executed on the database server itself, they can reduce the amount of data transferred over the network, especially for data-intensive operations.

**Parameterization:**Stored procedures can accept input parameters, making them flexible and adaptable to different scenarios. This parameterization allows for dynamic queries and condition-based operations.

**Error Handling:** Stored procedures can include error-handling logic, allowing you to handle exceptions and errors gracefully.

In [ ]:
CREATE PROCEDURE GetEmployeeDetails (@EmployeeID INT)
AS
BEGIN
    SELECT EmployeeName, Department
    FROM Employees
    WHERE EmployeeID = @EmployeeID;
END;

 the stored procedure GetEmployeeDetails accepts an EmployeeID parameter and returns the name and department of the employee with that ID from the "Employees" table.

To execute a stored procedure, you typically use a CALL or EXECUTE statement, depending on the DBMS you are using:

In [ ]:
-- Calling the stored procedure
EXECUTE GetEmployeeDetails;

# CTEs

CTEs provide a way to simplify complex SQL queries, break them into smaller, more manageable parts, and improve query readability

Basic structure

In [ ]:
WITH cte_name (column1, column2, ...) AS (
    -- CTE query definition here
)
-- Main query that uses the CTE
SELECT ...
FROM cte_name
WHERE ...

Orders
order_id	item	    amount	customer_id

1	      Keyboard	   400     	4

2	       Mouse	     300	    4

3	      Monitor	    12000	    3

4     	Keyboard	   400	    1

5       Mousepad     250    	2

this the table

In [ ]:
-- Define a Common Table Expression (CTE) named "CustomerTotalSpent"
WITH CustomerTotalSpent AS (
    SELECT
        customer_id,
        SUM(amount) AS total_amount_spent
    FROM
        Orders
    GROUP BY
        customer_id
)

-- Now, you can query the CTE
SELECT
    c.customer_id,
    c.total_amount_spent,
    o.item
FROM
    CustomerTotalSpent c
JOIN
    Orders o ON c.customer_id = o.customer_id
ORDER BY
    c.customer_id;

![CTES solution.PNG]()